app/controllers/to_do_items_controller.rb

SELECT "to_do_items".* FROM "to_do_items"
---
    def index
        @toDoItems = ToDoItem.all

INSERT INTO "to_do_items" ("activity", "user_id") VALUES (?, ?)  [["activity", ""], ["user_id", 9]]
---
    def create
        @toDoItem = ToDoItem.create(activity: params[:activity])